In [2]:
# https://www.zhihu.com/question/289788451/answer/1873472345  参考资料
import numpy as np # linear algebra
import pandas as pd # import in pandas

import os

In [4]:
# pandas 数据结构
## Series是一维标记数组。它可以容纳任何类型的数据。
mySeries = pd.Series([3,-5,7,4], index=['a','b','c','d'])
type(mySeries)
print(mySeries)

a    3
b   -5
c    7
d    4
dtype: int64

In [6]:
## Dataframe是一个二维数据结构，它包含列。
data = {'Country' : ['Belgium', 'India', 'Brazil' ],
        'Capital': ['Brussels', 'New Delhi', 'Brassilia'],
        'Population': [1234,1234,1234]}
datas = pd.DataFrame(data, columns=['Country','Capital','Population'])
print(type(data))
print(type(datas))
print(data)
print(datas)

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>
{'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brassilia'], 'Population': [1234, 1234, 1234]}
   Country    Capital  Population
0  Belgium   Brussels        1234
1    India  New Delhi        1234
2   Brazil  Brassilia        1234

In [10]:
### dataframe与array的转换
df=datas.values
print(df)
print(type(df))
df = pd.DataFrame(df)
print(df)

[['Belgium' 'Brussels' 1234]
 ['India' 'New Delhi' 1234]
 ['Brazil' 'Brassilia' 1234]]
<class 'numpy.ndarray'>
         0          1     2
0  Belgium   Brussels  1234
1    India  New Delhi  1234
2   Brazil  Brassilia  1234

In [11]:
# 调用，读取数据
## 读取csv
df = pd.read_csv('data.csv')
type(df)
## excel
pd.read_excel('filename')
pd.to_excel('dir/dataFrame.xlsx', sheet_name='Sheet1')

FileNotFoundError: [Errno 2] No such file or directory: 'data.csv'

In [12]:
# 数据存储
# -> Writes to a CSV file
df.to_csv(filename) 

# -> Writes to a CSV file
df.to_excel(filename) 

# -> Writes to a SQL table
df.to_sql(table_name, connection_object) 

# -> Writes to a file in JSON format
df.to_json(filename) 

# -> Saves as an HTML table
df.to_html(filename) 

# -> Writes to the clipboard
df.to_clipboard()

NameError: name 'filename' is not defined

In [17]:
import pandas as pd
df = pd.read_csv("./titanic/train.csv")

In [18]:
# 统计数据函数

## info函数提供有关数据信息：

###RangeIndex:指定有多少数据。
###Data Columns:指定找到多少列。
###Columns:提供关于Columns的信息。
###dtypes:它说你有什么类型的数据，你有多少这些数据。
###Memory Usage:表示内存使用量。
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
## 显示行列数
df.shape
## df.shape()是报错的，很容易发现df.shape实际上是个tuple，tuple不是callable的，所以不能df.shape()

(891, 12)

In [23]:
## 这段代码显示找到的索引总数。
df.index

RangeIndex(start=0, stop=891, step=1)

In [24]:
## 这段代码显示所有列
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [26]:
## 这段代码给出每一列中有多少数据
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [29]:
df.sum()

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                     21205.17
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9493
dtype: object

In [30]:
df.min()

PassengerId                      1
Survived                         0
Pclass                           1
Name           Abbing, Mr. Anthony
Sex                         female
Age                           0.42
SibSp                            0
Parch                            0
Ticket                      110152
Fare                           0.0
dtype: object

In [31]:
df.max()

PassengerId                            891
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                   80.0
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                              512.3292
dtype: object

In [32]:
## 函数提供了有关数据的基本统计信息（基于列计算）：count、mean、std、min、25%、50%、75%、max。
### count：数量统计，此列共有多少有效值
### unipue：不同的值有多少个
### std：标准差
### min：最小值
### 25%：四分之一分位数
### 50%：二分之一分位数
### 75%：四分之三分位数
### max：最大值
### mean：均值
#### 以上也能单独拿出来使用
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [38]:
## 该函数计算dataframe长度
len(df)

891

In [42]:
## 该函数返回数据框是否包含null值
df.isnull().head()  ### 不加head是所有的
## print(type(df.isnull()))  ### <class 'pandas.core.frame.DataFrame'>

<class 'pandas.core.frame.DataFrame'>

In [43]:
## 该函数返回列之间的相关系数,自动筛选掉了非数值的特征
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [44]:
# pandas中数据的选择和过滤

In [47]:
## 筛选列，选出来是series类型
df['Age']
print(type(df['Age'])) ## <class 'pandas.core.series.Series'>

<class 'pandas.core.series.Series'>

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [49]:
print(df[500:])
print(df[500:600])

     PassengerId  Survived  Pclass                                      Name  \
500          501         0       3                          Calic, Mr. Petar
501          502         0       3                       Canavan, Miss. Mary
502          503         0       3            O'Sullivan, Miss. Bridget Mary
503          504         0       3            Laitinen, Miss. Kristina Sofia
504          505         1       1                     Maioni, Miss. Roberta
..           ...       ...     ...                                       ...
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
500    male  17.0      0      0      315086   8.6625   NaN        S
501  female  21.0      0      0      364846   7.7500   NaN        Q
502  female   NaN      0      0      330909   7.6292   NaN        Q
503  female  37.0      0      0        4135   9.5875   NaN        S
504  female  16.0      0      0      110152  86.5000   B79        S
..      ...   ...    ...    ...         ...      ...   ...      ...
886    male  27.0      0      0      211536  13.0000   NaN        S
887  female  19.0      0      0      112053  30.0000   B42        S
888  female   NaN      1      2  W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0      111369  30.0000  C148        C
890    male  32.0      0      0      370376   7.7500   NaN        Q

[391 rows x 12 columns]
     PassengerId  Survived  Pclass  \
500          501         0       3
501          502         0       3
502          503         0       3
503          504         0       3
504          505         1       1
..           ...       ...     ...
595          596         0       3
596          597         1       2
597          598         0       3
598          599         0       3
599          600         1       1

                                             Name     Sex   Age  SibSp  Parch  \
500                              Calic, Mr. Petar    male  17.0      0      0
501                           Canavan, Miss. Mary  female  21.0      0      0
502                O'Sullivan, Miss. Bridget Mary  female   NaN      0      0
503                Laitinen, Miss. Kristina Sofia  female  37.0      0      0
504                         Maioni, Miss. Roberta  female  16.0      0      0
..                                            ...     ...   ...    ...    ...
595                   Van Impe, Mr. Jean Baptiste    male  36.0      1      1
596                    Leitch, Miss. Jessie Wills  female   NaN      0      0
597                           Johnson, Mr. Alfred    male  49.0      0      0
598                             Boulos, Mr. Hanna    male   NaN      0      0
599  Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")    male  49.0      1      0

       Ticket     Fare Cabin Embarked
500    315086   8.6625   NaN        S
501    364846   7.7500   NaN        Q
502    330909   7.6292   NaN        Q
503      4135   9.5875   NaN        S
504    110152  86.5000   B79        S
..        ...      ...   ...      ...
595    345773  24.1500   NaN        S
596    248727  33.0000   NaN        S
597      LINE   0.0000   NaN        S
598      2664   7.2250   NaN        C
599  PC 17485  56.9292   A20        C

[100 rows x 12 columns]

In [51]:
df.iloc[[0],[0]]

   PassengerId
0            1

In [52]:
df.loc[0:1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [53]:
df['PassengerId'][0]

1

In [54]:
## 该函数计算指定列中唯一的个数
df['PassengerId'].nunique()

891

In [61]:
## 该函数计算每一个唯一值对应的数量，不计算null/None。
### dropna = False 表示保留 nan，默认情况下 dropna 是true，即默认情况下不包含 nan
print(df['Sex'].value_counts(dropna =True))

male      577
female    314
Name: Sex, dtype: int64

In [62]:
df.tail()  # 返回后n行，默认5，和head对应

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [63]:
# df.nlargest(n,'columnName')同理，该函数返回最小的前n行数据框
# df[df.columnName < n]该函数返回指定列的值小于n的数据框
# df[['columnName1','columnName2']]该函数返回多个指定的列columnName1，columnName2，...，columnNamen
# df.loc[:,"columnName1":"columnName2"]该函数返回columnName1到columnName2之间的所有行的数据框
# df.loc[m:n,"columnName1":"columnName2"]该函数返回columnName1到columnName2之间的m：n行的数据框

# df.head(n)该函数返回数据框的前n行，n默认等于5
# df.tail(n)该函数返回数据框的后n行，n默认等于5
# df.sample(n)该函数随机采样数据框n行数据（按频数采用）
# df.sample(frac = a)该函数随机采样数据框的a倍行数据框，a的范围在0-1之间（按频率采样）
# df.nlargest(n,'columnName')该函数返回最大的前n行数据框

In [65]:
# 创建过滤器，实现自定义筛选
filters = df['Sex'] == 'male'
df[filters]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [73]:
## 该函数表示允许多个过滤条件并行
df[np.logical_and(df['PassengerId']>500, df['Sex'] == 'male' )]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
505,506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.0,1,0,PC 17758,108.9000,C65,C
507,508,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S
508,509,0,3,"Olsen, Mr. Henry Margido",male,28.0,0,0,C 4001,22.5250,NaN,S
509,510,1,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [77]:
## 我们用pandas的filter也可以进行上述操作,但是上面那个使用我们这个命令就报错
df[(df['PassengerId']>500) & (df['PassengerId']<520) & (df['Sex'] == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
505,506,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.0,1,0,PC 17758,108.9000,C65,C
507,508,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S
508,509,0,3,"Olsen, Mr. Henry Margido",male,28.0,0,0,C 4001,22.5250,NaN,S
509,510,1,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S
510,511,1,3,"Daly, Mr. Eugene Patrick",male,29.0,0,0,382651,7.7500,NaN,Q
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S
512,513,1,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S
514,515,0,3,"Coleff, Mr. Satio",male,24.0,0,0,349209,7.4958,NaN,S
515,516,0,1,"Walker, Mr. William Anderson",male,47.0,0,0,36967,34.0208,D46,S
517,518,0,3,"Ryan, Mr. Patrick",male,NaN,0,0,371110,24.1500,NaN,Q

In [78]:
# 数据排序

In [79]:
## 该函数表示，默认按照指定列的值的大小升序排列,false降序，默认true升序
df.sort_values('PassengerId', ascending= False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S

In [80]:
# df.rename(columns= {'columnName' : 'newColumnName'})
## 重命名列名：columnName原列，newColumnName需要修改的新的列名

In [81]:
## 定义新列：创建了下面Difference这个新的列

# df["Difference"] = df.High - df.Low
# df.head()

In [82]:
# 缺失值处理在featureEngineer.ipynb中

In [83]:
# 删除数据
# df.drop(columns=['columnName'])
# 该函数表示删除指定列

# mySeries.drop(['a'])
# 该函数表示删除序列中指定的值

In [84]:
# Apply函数
def examples(x):   #create a function
    return x*2

df['PassengerId'].apply(examples).head()  #use the function with apply()

0     2
1     4
2     6
3     8
4    10
Name: PassengerId, dtype: int64

In [86]:
# 转换数据类型
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
# df['columnName'] = df['columnName'].astype('dataType')
# 将指定列转化为指定的数据类型

In [87]:
df['PassengerId'] = df['PassengerId'].astype('float64')

In [89]:
df.dtypes

PassengerId    float64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [1]:
### 以上就是整个Pandas的使用频率最高的语法了，它完全可以解决你生活中的大部分数据处理环节了，一些更高阶的用法和更复杂的问题，可以在实际生活中灵活应用，度娘、知乎都是你可以查询的网站。